## Dealing with Database

Python needs a MySQL driver to access the MySQL database.

In [36]:
!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in /home/falcon/.local/lib/python3.13/site-packages (9.2.0)

In [37]:
import mysql.connector

In [38]:
import sqlite3

In [39]:
connection = sqlite3.connect("myemp.db")
print("Connected with the database successfully.....")

Connected with the database successfully.....

In [40]:
print(type(connection))

<class 'sqlite3.Connection'>

In [41]:
#Create employee table as employee(emp_id,emp_name,emp_city , emp_salary)

sqlStr = '''
            CREATE TABLE employee(
                emp_id TEXT PRIMARY KEY,
                emp_name TEXT,
                emp_city TEXT,
                emp_salary TEXT);

               '''

try:
    connection.execute(sqlStr)
    print("Table has been created succeesfully.......")
except:
    print("Error !!! Database table could not be created.....!!!")

Table has been created succeesfully.......

In [42]:
import csv
sqlStr = "INSERT INTO employee VALUES('{emp_name_ph}','{emp_name_ph}','{emp_city_ph}','{emp_salary_ph}')"
#ph = place holder

#read line from csv files and store them into table
with open("emp_data.csv") as datafile:
    csv_reader = csv.reader(datafile)
    print(csv_reader)
    print(list(csv_reader))

<_csv.reader object at 0x7fde46271770>
[['Emp_Id', 'Emp_Name', 'Emp_City', 'Emp_Salary', 'Emp_Age', 'Emp_Gender'], ['1001.00', 'Dhiman', 'Kolkata', '39000.00', '39.00', 'Male'], ['1002.00', 'Anupam', 'Kolkata', '25000.00', '25.00', 'Male'], ['1003.00', 'Subham', 'Mumbai', '36000.00', '36.00', 'Male'], ['1004.00', 'Dinesh', 'Chennai', '28000.00', '28.00', 'Male'], ['1005.00', 'Kakali', 'Mumbai', '25000.00', '34.00', 'Female'], ['1006.00', 'Bimal', 'Hyderabad', '30000.00', '30.00', 'Male'], ['1007.00', 'Tarun', 'Chennai', '17000.00', '22.00', 'Male'], ['1008.00', 'Rittika', 'Durgapur', '45000.00', '45.00', 'Female'], ['1009.00', 'Barun', 'Hyderabad', '39000.00', '39.00', 'Male'], ['1010.00', 'Anjali', 'Lucknow', '20000.00', '26.00', 'Female']]

In [43]:
 # Change to your DB and connection method
cursor = connection.cursor()

# Define the SQL statement with placeholders
sqlStr = "INSERT INTO employee VALUES (?, ?, ?, ?)"

# Open and read the CSV
with open("emp_data.csv", newline='') as datafile:
    csv_reader = csv.reader(datafile)
    next(csv_reader)  # Skip header
    for row in csv_reader:
        cursor.execute(sqlStr, (row[0], row[1], row[2], row[3]))

# Commit the changes
connection.commit()
print("All records got inserted successfully..........")

All records got inserted successfully..........

Retreving record from database table

In [44]:
sqlStr = "SELECT * FROM employee;"

cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-Id : {row[0]},Emp-Name: {row[1]},Emp-City : {row[2]} , Emp- salary :{row[3]}")

Emp-Id : 1001.00,Emp-Name: Dhiman,Emp-City : Kolkata , Emp- salary :39000.00
Emp-Id : 1002.00,Emp-Name: Anupam,Emp-City : Kolkata , Emp- salary :25000.00
Emp-Id : 1003.00,Emp-Name: Subham,Emp-City : Mumbai , Emp- salary :36000.00
Emp-Id : 1004.00,Emp-Name: Dinesh,Emp-City : Chennai , Emp- salary :28000.00
Emp-Id : 1005.00,Emp-Name: Kakali,Emp-City : Mumbai , Emp- salary :25000.00
Emp-Id : 1006.00,Emp-Name: Bimal,Emp-City : Hyderabad , Emp- salary :30000.00
Emp-Id : 1007.00,Emp-Name: Tarun,Emp-City : Chennai , Emp- salary :17000.00
Emp-Id : 1008.00,Emp-Name: Rittika,Emp-City : Durgapur , Emp- salary :45000.00
Emp-Id : 1009.00,Emp-Name: Barun,Emp-City : Hyderabad , Emp- salary :39000.00
Emp-Id : 1010.00,Emp-Name: Anjali,Emp-City : Lucknow , Emp- salary :20000.00

## Select query 1

## SQL for fetching name and salary of those employees whose salary is greater than 30000

In [45]:
sqlStr = "SELECT emp_name,emp_salary from employee WHERE emp_salary > 30000;"
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-Name : {row[0]} , Emp-Salary :{row[1]}")

Emp-Name : Dhiman , Emp-Salary :39000.00
Emp-Name : Subham , Emp-Salary :36000.00
Emp-Name : Bimal , Emp-Salary :30000.00
Emp-Name : Rittika , Emp-Salary :45000.00
Emp-Name : Barun , Emp-Salary :39000.00

## Select query 2

## Fetch employee name , salary and 7.5% TDS against the salaries of all the employee

In [46]:
sqlStr = "SELECT emp_name,emp_salary,emp_salary*0.75 FROM employee;"
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-Name : {row[0]} , Emp-Salary :{row[1]} , TDS : {row[2]}")

Emp-Name : Dhiman , Emp-Salary :39000.00 , TDS : 29250.0
Emp-Name : Anupam , Emp-Salary :25000.00 , TDS : 18750.0
Emp-Name : Subham , Emp-Salary :36000.00 , TDS : 27000.0
Emp-Name : Dinesh , Emp-Salary :28000.00 , TDS : 21000.0
Emp-Name : Kakali , Emp-Salary :25000.00 , TDS : 18750.0
Emp-Name : Bimal , Emp-Salary :30000.00 , TDS : 22500.0
Emp-Name : Tarun , Emp-Salary :17000.00 , TDS : 12750.0
Emp-Name : Rittika , Emp-Salary :45000.00 , TDS : 33750.0
Emp-Name : Barun , Emp-Salary :39000.00 , TDS : 29250.0
Emp-Name : Anjali , Emp-Salary :20000.00 , TDS : 15000.0

## SELECT QUERY 3

## Display city wise average salaries of all employees from the employee table

In [47]:
sqlStr = "SELECT emp_city ,AVG(emp_salary) AS Average_Salary FROM employee GROUP BY emp_city;"
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-City : {row[0]} , Avg Salary :{row[1]}")

Emp-City : Chennai , Avg Salary :22500.0
Emp-City : Durgapur , Avg Salary :45000.0
Emp-City : Hyderabad , Avg Salary :34500.0
Emp-City : Kolkata , Avg Salary :32000.0
Emp-City : Lucknow , Avg Salary :20000.0
Emp-City : Mumbai , Avg Salary :30500.0

## INSERT QUERY 4

## Insert n number of records into the employee table after taking required inputs from the user

In [ ]:
n = int(input("Enter the number of records you want to insert : "))
cursor = connection.cursor()
sqlStr = "INSERT INTO employee VALUES(?,?,?,?);"
for i in range(n):
    emp_id = int(input("Enter the employee ID :"))
    emp_name =input("Enter the employee name :")
    emp_city = input("Enter the employee city :")
    emp_salary = float(input("Enter the employee Salary :"))
    cursor.execute(sqlStr,(emp_id,emp_name,emp_city,emp_salary))
connection.commit()
print("All records got inserted successfully..........")

## Retreving records from the databse table

In [55]:
sqlStr = "SELECT * FROM employee;"
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp_ID : {row[0]} , Emp-Name : {row[1]} , Emp_City : {row[2]} , Emp-Salary :{row[3]}")

Emp_ID : 1001.00 , Emp-Name : Dhiman , Emp_City : Kolkata , Emp-Salary :39000.00
Emp_ID : 1002.00 , Emp-Name : Anupam , Emp_City : Kolkata , Emp-Salary :25000.00
Emp_ID : 1003.00 , Emp-Name : Subham , Emp_City : Mumbai , Emp-Salary :36000.00
Emp_ID : 1004.00 , Emp-Name : Dinesh , Emp_City : Chennai , Emp-Salary :28000.00
Emp_ID : 1005.00 , Emp-Name : Kakali , Emp_City : Mumbai , Emp-Salary :25000.00
Emp_ID : 1006.00 , Emp-Name : Bimal , Emp_City : Hyderabad , Emp-Salary :30000.00
Emp_ID : 1007.00 , Emp-Name : Tarun , Emp_City : Chennai , Emp-Salary :17000.00
Emp_ID : 1009.00 , Emp-Name : Barun , Emp_City : Hyderabad , Emp-Salary :39000.00
Emp_ID : 1010.00 , Emp-Name : Anjali , Emp_City : Lucknow , Emp-Salary :20000.00
Emp_ID : 2723 , Emp-Name : Asad , Emp_City : Jamshedpur , Emp-Salary :3600000.0
Emp_ID : 741 , Emp-Name : Nitesh , Emp_City : Dhanbaad , Emp-Salary :89000.0

## DELETING record from the table

## DELETE those records where city = "Bangalore"

In [56]:
sqlStr = "DELETE FROM employee WHERE emp_city ='Bangalore';"
table=connection.execute(sqlStr)
connection.commit()
print("So the number of records deleted is :",table.rowcount)

So the number of records deleted is : 0

## DELETING record from the table

## DELETE those records where city = "Durgapur"

In [57]:
sqlStr = "DELETE FROM employee WHERE emp_city ='Durgapur';"
table=connection.execute(sqlStr)
connection.commit()
print("So the number of records deleted is :",table.rowcount)

So the number of records deleted is : 0

In [58]:
sqlStr = "SELECT * FROM employee;"
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp_ID : {row[0]} , Emp-Name : {row[1]} , Emp_City : {row[2]} , Emp-Salary :{row[3]}")

Emp_ID : 1001.00 , Emp-Name : Dhiman , Emp_City : Kolkata , Emp-Salary :39000.00
Emp_ID : 1002.00 , Emp-Name : Anupam , Emp_City : Kolkata , Emp-Salary :25000.00
Emp_ID : 1003.00 , Emp-Name : Subham , Emp_City : Mumbai , Emp-Salary :36000.00
Emp_ID : 1004.00 , Emp-Name : Dinesh , Emp_City : Chennai , Emp-Salary :28000.00
Emp_ID : 1005.00 , Emp-Name : Kakali , Emp_City : Mumbai , Emp-Salary :25000.00
Emp_ID : 1006.00 , Emp-Name : Bimal , Emp_City : Hyderabad , Emp-Salary :30000.00
Emp_ID : 1007.00 , Emp-Name : Tarun , Emp_City : Chennai , Emp-Salary :17000.00
Emp_ID : 1009.00 , Emp-Name : Barun , Emp_City : Hyderabad , Emp-Salary :39000.00
Emp_ID : 1010.00 , Emp-Name : Anjali , Emp_City : Lucknow , Emp-Salary :20000.00
Emp_ID : 2723 , Emp-Name : Asad , Emp_City : Jamshedpur , Emp-Salary :3600000.0
Emp_ID : 741 , Emp-Name : Nitesh , Emp_City : Dhanbaad , Emp-Salary :89000.0